# InitialFluxIntensity Constructor (InitialFluxIntensity) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialFluxIntensity Constructor (InitialFluxIntensity)
InitialFluxIntensity Class See Also
---
Creates a copy of the given initial flux intensity object
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public InitialFluxIntensity(
	InitialFluxIntensity other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As InitialFluxIntensity _
)
```

Visual C++
---
```text
public:
InitialFluxIntensity(
	InitialFluxIntensity^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..InitialFluxIntensity
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InitialFluxIntensity Class
InitialFluxIntensity Overload
Autodesk.Revit.DB.Lighting Namespace